[
    {
      "id": 25,
      "nombre": "Pikachu",
      "numero": "#025",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/25.png",
      "tipo": ["Eléctrico"],
      "descripcion": "<p><strong>Pikachu</strong> es uno de los Pokémon más reconocidos y queridos en todo el mundo. Este pequeño roedor de tipo eléctrico es famoso por sus mejillas rojas que almacenan electricidad y su icónica cola en forma de rayo.</p><p>Pikachu vive en bosques y zonas arboladas, donde se alimenta de bayas. Cuando varios Pikachu se juntan, pueden causar tormentas eléctricas masivas. Su evolución desde <em>Pichu</em> ocurre cuando alcanza un alto nivel de felicidad con su entrenador.</p><p>En combate, Pikachu es conocido por sus poderosos ataques eléctricos como <strong>Impactrueno</strong> y <strong>Rayo</strong>. A pesar de su pequeño tamaño, puede generar descargas eléctricas de hasta 100,000 voltios. Los Pikachu machos tienen la cola con forma de rayo puntiaguda, mientras que las hembras tienen la punta con forma de corazón.</p><p>Pikachu puede evolucionar a <strong>Raichu</strong> mediante una Piedra Trueno, aunque muchos entrenadores prefieren mantenerlo sin evolucionar por su carisma natural.</p>"
    },
    {
      "id": 6,
      "nombre": "Charizard",
      "numero": "#006",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/6.png",
      "tipo": ["Fuego", "Volador"],
      "descripcion": "<p><strong>Charizard</strong> es la evolución final de Charmander, uno de los Pokémon iniciales más populares de la región de Kanto. Este imponente dragón de tipo Fuego y Volador es conocido por su feroz apariencia y sus devastadores ataques de fuego.</p><p>Con sus alas poderosas, Charizard puede volar hasta alturas de 1,400 metros sobre el nivel del mar. La llama de su cola arde intensamente cuando está emocionado o enfadado, y si esta llama se apaga, el Charizard perdería la vida, por lo que siempre la protege celosamente.</p><p>En batalla, Charizard es un oponente formidable que puede aprender movimientos devastadores como <strong>Lanzallamas</strong>, <strong>Garra Dragón</strong> y <strong>Vuelo</strong>. Su temperatura corporal puede alcanzar niveles extremos cuando está preparado para la batalla.</p><p>Charizard posee dos <em>Megaevoluciones</em>: Mega-Charizard X (que se convierte en tipo Fuego/Dragón con llamas azules) y Mega-Charizard Y (que incrementa su poder especial). También tiene una forma <strong>Gigamax</strong> que aumenta enormemente su tamaño y poder.</p><p>Los entrenadores experimentados saben que Charizard puede ser orgulloso y solo obedece a aquellos que considera dignos de su respeto.</p>"
    },
    {
      "id": 1,
      "nombre": "Bulbasaur",
      "numero": "#001",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/1.png",
      "tipo": ["Planta", "Veneno"],
      "descripcion": "<p><strong>Bulbasaur</strong> tiene el honor de ser el Pokémon número 1 en la Pokédex Nacional. Este adorable Pokémon de tipo Planta y Veneno es uno de los tres iniciales que los entrenadores pueden elegir en la región de Kanto.</p><p>La característica más distintiva de Bulbasaur es el <em>bulbo</em> que lleva en su espalda desde que nace. Este bulbo contiene una semilla que crece junto con el Pokémon, absorbiendo luz solar y convirtiéndola en energía. A medida que Bulbasaur se fortalece, el bulbo crece más grande hasta que finalmente florece cuando evoluciona.</p><p>Bulbasaur es conocido por su naturaleza tranquila y leal. En su hábitat natural, suele encontrarse en praderas y bosques soleados donde puede absorber la luz del sol. Durante el día, toma siestas bajo el sol para que su bulbo crezca más fuerte.</p><p>Sus ataques incluyen movimientos como <strong>Látigo Cepa</strong>, <strong>Hoja Afilada</strong> y <strong>Polvo Veneno</strong>. Bulbasaur evoluciona a <strong>Ivysaur</strong> en el nivel 16 y posteriormente a <strong>Venusaur</strong> en el nivel 32. Venusaur puede Megaevolucionar y también tiene una forma Gigamax.</p><p>Muchos entrenadores consideran a Bulbasaur como el inicial más equilibrado debido a su ventaja de tipo contra los dos primeros líderes de gimnasio en Kanto.</p>"
    },
    {
      "id": 7,
      "nombre": "Squirtle",
      "numero": "#007",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/7.png",
      "tipo": ["Agua"],
      "descripcion": "<p><strong>Squirtle</strong> es el Pokémon inicial de tipo Agua de la región de Kanto, conocido por su adorable apariencia de tortuga y su caparazón marrón resistente. Este pequeño Pokémon acuático es querido por entrenadores de todo el mundo por su personalidad amigable y su gran potencial en batalla.</p><p>El caparazón de Squirtle no solo le proporciona protección superior contra ataques, sino que también está diseñado hidrodinámicamente para nadar a altas velocidades. Puede retraer su cabeza y extremidades dentro del caparazón para defenderse de los ataques enemigos. La forma redondeada del caparazón ayuda a reducir la resistencia al agua cuando nada.</p><p>Squirtle puede lanzar potentes chorros de agua desde su boca, siendo capaz de alcanzar objetivos con precisión increíble. Sus ataques de agua como <strong>Pistola Agua</strong> y <strong>Hidrobomba</strong> son especialmente efectivos. A medida que crece, la presión del agua que puede disparar aumenta significativamente.</p><p>Este Pokémon evoluciona a <strong>Wartortle</strong> en el nivel 16, desarrollando una cola más peluda y orejas características. Finalmente evoluciona a <strong>Blastoise</strong> en el nivel 36, ganando potentes cañones de agua en su caparazón. Blastoise puede Megaevolucionar y también posee una forma Gigamax.</p><p>Curiosamente, existe un grupo de Squirtle salvajes conocido como el <em>Escuadrón Squirtle</em>, que usan gafas de sol oscuras y trabajan como bomberos, mostrando la versatilidad y utilidad de este Pokémon más allá del combate.</p>"
    },
    {
      "id": 150,
      "nombre": "Mewtwo",
      "numero": "#150",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/150.png",
      "tipo": ["Psíquico"],
      "descripcion": "<p><strong>Mewtwo</strong> es un Pokémon legendario de tipo Psíquico, considerado uno de los más poderosos que existen. Fue creado artificialmente por científicos mediante la manipulación genética del ADN de <strong>Mew</strong>, el Pokémon ancestral, con el objetivo de crear el Pokémon de combate definitivo.</p><p>La historia de Mewtwo es trágica y compleja. Fue creado en la Mansion Pokémon de la Isla Canela mediante experimentos de clonación brutal. Los científicos potenciaron sus habilidades para el combate sin considerar las implicaciones éticas, lo que llevó a Mewtwo a desarrollar un profundo resentimiento hacia los humanos y cuestionar su propia existencia.</p><p>Mewtwo posee poderes psíquicos incomparables que le permiten levitar, comunicarse telepáticamente, controlar mentes, manipular objetos con el pensamiento y lanzar ondas psíquicas devastadoras. Su ataque <strong>Psicorte</strong> puede dividir cualquier cosa con poder mental puro, y su <strong>Psicoataque</strong> es legendario por su poder destructivo.</p><p>Físicamente, Mewtwo mide aproximadamente 2 metros de altura y tiene una cola larga y poderosa que ayuda a mantener el balance. Su cuerpo fue diseñado para maximizar su poder psíquico, con una estructura que minimiza el gasto de energía.</p><p>Mewtwo puede Megaevolucionar de dos formas diferentes: <strong>Mega-Mewtwo X</strong> (que gana el tipo Lucha además de Psíquico y aumenta su ataque físico) y <strong>Mega-Mewtwo Y</strong> (que permanece tipo Psíquico puro pero incrementa enormemente su ataque especial). Ambas formas son extremadamente poderosas y temidas en combate.</p><p>A pesar de su poder, Mewtwo lucha internamente con preguntas sobre su propósito y lugar en el mundo, habiéndose preguntado repetidamente: <em>¿Quién soy? ¿Para qué existo?</em></p>"
    },
    {
      "id": 133,
      "nombre": "Eevee",
      "numero": "#133",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/133.png",
      "tipo": ["Normal"],
      "descripcion": "<p><strong>Eevee</strong> es uno de los Pokémon más únicos y fascinantes debido a su extraordinaria capacidad de evolucionar en múltiples formas diferentes. Este pequeño Pokémon de tipo Normal tiene un código genético irregular que le permite adaptarse a diversos entornos mediante la evolución.</p><p>Eevee es conocido por su apariencia adorable, con un pelaje marrón esponjoso, una cola tupida con punta color crema, y grandes ojos marrones expresivos. Su collar de pelo alrededor del cuello le da una apariencia distintiva y encantadora que lo hace muy popular entre los entrenadores.</p><p>Lo más notable de Eevee son sus <strong>ocho evoluciones diferentes</strong>, conocidas como las \"Eeveeluciones\": <strong>Vaporeon</strong> (Agua), <strong>Jolteon</strong> (Eléctrico), <strong>Flareon</strong> (Fuego), <strong>Espeon</strong> (Psíquico), <strong>Umbreon</strong> (Siniestro), <strong>Leafeon</strong> (Planta), <strong>Glaceon</strong> (Hielo), y <strong>Sylveon</strong> (Hada). Cada evolución se desencadena por diferentes métodos: piedras evolutivas, alta felicidad durante el día o la noche, o cercanía a rocas especiales.</p><p>El ADN de Eevee es extremadamente inestable y responde fácilmente a la radiación de las piedras evolutivas o a las condiciones ambientales. Esta inestabilidad genética es tanto una bendición como un enigma para los científicos Pokémon que estudian los mecanismos de evolución.</p><p>En batalla, Eevee puede aprender una gran variedad de movimientos de diferentes tipos, lo que lo hace versátil antes de evolucionar. Su habilidad característica <em>Adaptación</em> le permite adaptarse a diferentes situaciones de combate.</p><p>Eevee también posee una forma <strong>Gigamax</strong> cuando es capturado en eventos especiales, convirtiéndose en un Eevee enorme con un collar de pelo aún más esponjoso que fascina a todos los que lo ven.</p>"
    },
    {
      "id": 94,
      "nombre": "Gengar",
      "numero": "#094",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/94.png",
      "tipo": ["Fantasma", "Veneno"],
      "descripcion": "<p><strong>Gengar</strong> es la evolución final de Gastly y uno de los Pokémon de tipo Fantasma y Veneno más icónicos y poderosos. Conocido por su sonrisa traviesa y maliciosa, Gengar es un Pokémon que habita en las sombras y disfruta gastando bromas aterradoras a humanos y Pokémon por igual.</p><p>La forma de Gengar es corpulenta y redondeada, con un color púrpura oscuro característico. Sus ojos rojos brillan en la oscuridad y su amplia sonrisa llena de dientes puntiagudos es inconfundible. Las púas en su espalda añaden a su apariencia intimidante.</p><p>Gengar tiene la abilidad única de esconderse en las sombras de otros seres. Se dice que cuando sientes un escalofrío repentino, es porque un Gengar está cerca, absorbiendo el calor de tu cuerpo. Puede aparecer y desapar en la oscuridad a voluntad, haciendo que sea casi imposible de atrapar si no quiere ser visto.</p><p>Una característica escalofriante de Gengar es que intenta <em>separar a las personas de sus sombras</em> para que se conviertan en parte del mundo de los fantasmas. Según las leyendas, Gengar es en realidad la sombra de un Clefable, aunque esto nunca ha sido confirmado científicamente.</p><p>En combate, Gengar es extremadamente peligroso. Puede usar ataques como <strong>Bola Sombra</strong>, <strong>Bomba Lodo</strong>, <strong>Lengüetazo</strong> y <strong>Hipnosis</strong>. Su combinación de velocidad alta y ataque especial poderoso lo hace un contrincante formidable. Su habilidad <em>Levitación</em> lo hace inmune a movimientos de tipo Tierra.</p><p>Gengar puede <strong>Megaevolucionar</strong> a Mega-Gengar, una forma aún más aterradora donde parte de su cuerpo se hunde en otra dimensión. También posee una forma <strong>Gigamax</strong> donde su boca se convierte en una entrada al inframundo, capaz de absorber todo lo que se acerque demasiado.</p><p>A pesar de su naturaleza traviesa y a veces maliciosa, Gengar puede ser leal a entrenadores que respeta y ha demostrado un lado juguetón cuando está de buen humor.</p>"
    },
    {
      "id": 149,
      "nombre": "Dragonite",
      "numero": "#149",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/149.png",
      "tipo": ["Dragón", "Volador"],
      "descripcion": "<p><strong>Dragonite</strong> es un Pokémon pseudo-legendario de tipo Dragón y Volador, siendo la evolución final de Dratini. A pesar de su apariencia amigable y corpulenta, Dragonite es uno de los Pokémon más poderosos y respetados que existen, conocido por su increíble fuerza y velocidad de vuelo.</p><p>Con su piel naranja brillante, alas pequeñas pero poderosas, antenas en su cabeza y una expresión facial amable, Dragonite puede parecer menos intimidante que otros dragones, pero no hay que dejarse engañar por su apariencia bonachona. Este Pokémon es capaz de volar alrededor del mundo en solo 16 horas, alcanzando velocidades supersónicas.</p><p>Dragonite es conocido por su naturaleza noble y protectora. Hay muchas historias de Dragonite rescatando a marineros náufragos y guiándolos de vuelta a la costa. Vive en el mar, específicamente en una isla remota donde otros Dragonite también habitan, aunque rara vez es visto por humanos debido a su naturaleza reclusiva.</p><p>A pesar de su temperamento generalmente calmado, Dragonite puede desatar una furia terrible si alguien daña su entorno natural o amenaza a seres inocentes. Se dice que cuando Dragonite está furioso, puede causar tormentas masivas con solo batir sus alas. Su <strong>Hiperrayo</strong> es legendario por su poder destructivo.</p><p>En combate, Dragonite es extremadamente versátil. Puede aprender una amplia variedad de movimientos incluyendo <strong>Garra Dragón</strong>, <strong>Vuelo</strong>, <strong>Danza Dragón</strong>, <strong>Trueno</strong>, <strong>Lanzallamas</strong> y <strong>Puño Hielo</strong>. Esta versatilidad lo hace capaz de enfrentar casi cualquier tipo de oponente.</p><p>Sus estadísticas base totales son de 600, colocándolo en la categoría de pseudo-legendarios junto con Pokémon como Tyranitar, Salamence y Metagross. Su habilidad oculta <em>Multiscale</em> reduce el daño recibido cuando está con salud completa, haciéndolo aún más resistente.</p><p>Dragonite evoluciona de Dragonair en el nivel 55, siendo una evolución bastante tardía pero que vale completamente la pena por el poder que otorga. Es un favorito entre entrenadores competitivos por su equilibrio perfecto entre ataque físico, defensa y velocidad.</p>"
    },
    {
      "id": 39,
      "nombre": "Jigglypuff",
      "numero": "#039",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/39.png",
      "tipo": ["Normal", "Hada"],
      "descripcion": "<p><strong>Jigglypuff</strong> es un adorable Pokémon de tipo Normal y Hada conocido mundialmente por su capacidad única de cantar canciones de cuna que hacen que cualquiera que las escuche se quede profundamente dormido. Este pequeño Pokémon esférico y rosado tiene grandes ojos azules y orejas de gato que lo hacen irresistiblemente tierno.</p><p>El cuerpo de Jigglypuff es extremadamente suave y elástico, similar a un globo. Esta elasticidad le permite inflarse hasta alcanzar tamaños considerables, lo que usa tanto para flotar como para intimidar a oponentes. Sus pulmones tienen una capacidad extraordinaria que le permite cantar durante períodos muy largos sin necesidad de respirar.</p><p>La canción de Jigglypuff es su característica más famosa. Cuando canta su melodiosa <strong>Canto</strong>, las ondas sonoras tienen un efecto hipnótico que induce el sueño en todos los que la escuchan, incluyendo otros Pokémon y humanos. El problema es que Jigglypuff se ofende mucho cuando su audiencia se duerme, ya que interpreta esto como una falta de apreciación a su arte vocal.</p><p>Cuando Jigglypuff descubre que su audiencia se ha dormido, saca un marcador permanente de su pelaje y dibuja en las caras de los dormidos como forma de expresar su frustración. Esta peculiar reacción ha hecho de Jigglypuff un personaje memorable y cómico en muchas aventuras.</p><p>En batalla, Jigglypuff puede usar movimientos como <strong>Canto</strong>, <strong>Destructor</strong>, <strong>Doble Bofetón</strong> y <strong>Voz Cautivadora</strong>. Su habilidad <em>Gran Encanto</em> puede enamorar a Pokémon del sexo opuesto al hacer contacto, añadiendo otra capa a sus capacidades de soporte en combate.</p><p>Jigglypuff evoluciona de <strong>Igglybuff</strong> mediante alta felicidad y puede evolucionar a <strong>Wigglytuff</strong> usando una Piedra Lunar. Wigglytuff tiene un pelaje aún más suave y mayor resistencia física. Jigglypuff también tiene una forma <strong>Gigamax</strong> que lo convierte en un Jigglypuff gigante con capacidades aún más impresionantes.</p><p>Curiosamente, Jigglypuff es también conocido por aparecer frecuentemente en combates competitivos en el juego Super Smash Bros., donde su movimiento <em>Descanso</em> es uno de los ataques más poderosos del juego si se conecta correctamente.</p>"
    },
    {
      "id": 143,
      "nombre": "Snorlax",
      "numero": "#143",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/143.png",
      "tipo": ["Normal"],
      "descripcion": "<p><strong>Snorlax</strong> es un Pokémon de tipo Normal masivo, conocido por ser uno de los Pokémon más perezosos y dormilones que existen. Este gigante amigable pasa la mayor parte de su tiempo durmiendo y comiendo, siendo famoso por bloquear caminos importantes mientras toma sus largas siestas.</p><p>Con un peso que típicamente supera los 460 kilogramos, Snorlax es uno de los Pokémon más pesados fuera de los legendarios. Su cuerpo es grande, redondo y corpulento, cubierto con pelaje azul-verdoso oscuro. Tiene una gran barriga color crema donde se acumula la comida que consume, y pequeños pies que sorprendentemente pueden soportar su enorme peso.</p><p>Snorlax necesita consumir al menos <strong>400 kilogramos de comida al día</strong> para estar satisfecho. Puede comer casi cualquier cosa, incluso comida podrida o mohosa, gracias a su estómago resistente. Después de comer su gran cantidad diaria de comida, inmediatamente se queda dormido para digerir. Este ciclo de comer y dormir se repite constantemente.</p><p>El sueño de Snorlax es tan profundo que es prácticamente imposible despertarlo por medios convencionales. Solo la melodía especial de la <strong>Poké Flauta</strong> puede despertarlo de su profundo letargo. Puede dormir en cualquier lugar y en cualquier posición, siendo capaz de dormir incluso de pie si es necesario.</p><p>A pesar de su naturaleza perezosa, Snorlax es extremadamente poderoso en combate. Su enorme cuerpo le proporciona una defensa y resistencia excepcionales. Puede usar movimientos devastadores como <strong>Gigaimpacto</strong>, <strong>Terremoto</strong>, <strong>Corpulencia</strong> y <strong>Descanso</strong> (que lo cura completamente mientras duerme).</p><p>En su forma <strong>Gigamax</strong>, Snorlax se vuelve aún más enorme, con un árbol gigante creciendo de su estómago. Su movimiento exclusivo <em>Presa Gigamax</em> puede atrapar a los oponentes y causar daño continuo. La tierra se hunde bajo el peso de Gigamax Snorlax.</p><p>Snorlax tiene una pre-evolución llamada <strong>Munchlax</strong>, que es igualmente glotona pero más activa y juguetona. Munchlax evoluciona a Snorlax cuando sube de nivel con alta felicidad, generalmente después de haber compartido muchas comidas con su entrenador.</p><p>Los entrenadores que logran ganarse la confianza de un Snorlax descubren que, a pesar de su pereza, es un compañero leal y extremadamente poderoso que puede ser el pilar de cualquier equipo gracias a su increíble aguante y fuerza bruta.</p>"
    },
    {
      "id": 131,
      "nombre": "Lapras",
      "numero": "#131",
      "imagen": "https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/131.png",
      "tipo": ["Agua", "Hielo"],
      "descripcion": "<p><strong>Lapras</strong> es un Pokémon majestuoso de tipo Agua y Hielo que se asemeja a un plesiosauro con un caparazón en su espalda. Este gentil gigante de los mares es conocido por su naturaleza amable, su inteligencia superior y su disposición a ayudar a los humanos, especialmente transportándolos a través del agua.</p><p>Con su largo cuello, aletas robustas y su distintivo caparazón gris con espiral, Lapras es inmediatamente reconocible. Su piel es de un color azul profundo que le ayuda a camuflarse en las aguas oceánicas. Los ojos de Lapras son grandes y expresivos, mostrando su naturaleza gentil y comprensiva.</p><p>Lapras es altamente inteligente y puede entender el lenguaje humano perfectamente. Se dice que disfruta transportar personas y Pokémon en su espalda a través de mares y lagos, deslizándose suavemente sobre las olas. Su caparazón es lo suficientemente fuerte y espacioso como para llevar varios pasajeros cómodamente, convirtiéndolo en un medio de transporte ideal.</p><p>Tristemente, Lapras estuvo al borde de la extinción debido a la caza excesiva. Los humanos capturaban Lapras por su carne y su caparazón, reduciendo drásticamente su población. Gracias a esfuerzos de conservación estrictos, la especie se está recuperando lentamente, aunque todavía es considerada rara en la naturalía.</p><p>Una de las habilidades más notables de Lapras es su capacidad de cantar. Su <strong>Canto Helado</strong> es una hermosa melodía que puede apaciguar a Pokémon salvajes agresivos y calmar tormentas marinas. Los marineros antiguos creían que escuchar el canto de un Lapras era señal de buena suerte y mares tranquilos.</p><p>En combate, Lapras combina ataques de Agua y Hielo con gran efectividad. Puede usar <strong>Hidrobomba</strong>, <strong>Rayo Hielo</strong>, <strong>Psíquico</strong>, <strong>Trueno</strong> y <strong>Surf</strong>. Su gran resistencia y puntos de salud lo hacen extremadamente duradero en batalla. Su habilidad <em>Absorbe Agua</em> restaura su salud cuando es golpeado por movimientos de tipo Agua.</p><p>Lapras tiene una forma <strong>Gigamax</strong> donde su caparazón se expande dramáticamente y se llena de agua congelada, creando un iceberg flotante en su espalda. Su movimiento exclusivo <em>Resonancia Gigamax</em> crea la Aurora Boreal en el campo de batalla, reduciendo el daño que reciben los aliados.</p><p>Los Lapras migran en grupos grandes entre las aguas frías y cálidas según las estaciones. Durante estos viajes migratorios, pueden recorrer miles de kilómetros, y se ha observado que los grupos familiares de Lapras mantienen fuertes lazos durante toda su vida.</p>"
    }]